#!/usr/bin/env python
# -*- coding: utf-8 -*-

# написать программу при запуске которая выводит Hello world! - 10 раз
# и в следующей строке печатает сумму 1 + 10 + '11'

a = 1 + 10 + int('11')
print('Hello World! ' * 10 + '\n' + str(a))
